using System;
using System.Collections.Generic;
using System.Text;

namespace exam483.chapter2._Types
{
    class Skill1_Create
    {
        /* Структуры - нет конструктора по умолчанию, нельзя в структуре инициализировать переменные.
         * Структуры хранятся в стэке (кроме замыкания), массив структур - непрерывный блок памяти
         * Стек - это область памяти, которая выделяется и удаляется (просто отбрасывается) при входе и выходе из блоков
         */

        public void Do()
        {

        }
    }
}
