namespace exam483.chapter3._Debug._Security
{
    class Skill3_Assemblies
    {
        /*
         * IL JIT - компиляция MSIL во время исполнения в конкретную версию
         *          байт кода на определенной машине перед выполнением метода
         * Манифест определяет содержимое сборки - файлы, ресурсы
         *
         *Сборка со строгим именем имеет полностью определенное имя, состоящее из имени сборки, культуры сборки,
         * токена открытого ключа и номера версии.
         * PublicKeyToken - это 64-битный (8 байт) хэш открытого ключа в строгом имени.
         * Это гарантирует, что каждое полное имя сборки является уникальным.
         * 
         *
         * 
         */

        public void Do()
        {


        }
    }
}
